Core/src/Enums/ВидыЗадачСобытийКалендаря/ВидыЗадачСобытийКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗадачСобытийКалендаря</name>
  <enumValues>
    <name>ЗаполнениеДанных</name>
  </enumValues>
  <enumValues>
    <name>Отчетность</name>
  </enumValues>
  <enumValues>
    <name>НалогиИВзносы</name>
  </enumValues>
</mdclass:Enum>

Core/src/CommonModules/КалендарьОтчетностиПовтИсп/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Размещаются процедуры и функции для работы по разделу Календарь отчетности



// Функция возвращает начальный статус события календаря
// по виду задачи используемой в данном событии
// Начальный статус всегда равен НеНачато, 
// но дополнительная информация содержит комментарии, которые и возвращаются этой функцией
//
// Параметры:
//		СправочникСсылка.ЗадачиКалендаряПодготовкиОтчетности
// Возвращает:
//		Строка
Функция ПолучитьНачальныйСтатусСобытияПоВидуЗадачи(Задача) Экспорт
	
	ВидЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "ВидЗадачи");
	
	Если ВидЗадачи = Перечисления.ВидыЗадачСобытийКалендаря.ЗаполнениеДанных Тогда
		Возврат НСтр("ka='შევსება';ru='Заполнить';en='Insert'");
	ИначеЕсли ВидЗадачи = Перечисления.ВидыЗадачСобытийКалендаря.Отчетность Тогда
		Возврат НСтр("ka='ფორმირება';ru='Сформировать';en='to form'");
	ИначеЕсли ВидЗадачи = Перечисления.ВидыЗадачСобытийКалендаря.НалогиИВзносы Тогда
		Возврат НСтр("ka='გამოთვლა';ru='Рассчитать';en='calculate'");
	КонецЕсли;
	
КонецФункции


Функция ПолучитьСтандартныйПериодДокументовДляСобытия(Событие) Экспорт
	
	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Событие, "ДатаНачалаДокументов, ДатаОкончанияДокументов");
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = Значения.ДатаНачалаДокументов;
	Период.ДатаОкончания = КонецДня(Значения.ДатаОкончанияДокументов);
	
	Возврат Период;
	
КонецФункции
